test_initialization: true
test_iter: 200
test_interval: 1000
base_lr: 0.01
lr_policy: "step"
gamma: 0.1
stepsize: 100000
display: 20
max_iter: 320000
momentum: 0.9
weight_decay: 0.0005
snapshot: 10000
iter_size: 1
solver_mode: GPU
solver_type: SGD
snapshot_prefix: "/media/old-ufo/MyBook/caffe-train-snashots/imagenet128/ThinResNet128_lsuv"

net_param { 
name: "ThinnerResNet-101"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
 transform_param {
    force_color: true
    scale: 0.04
    mirror: true
    crop_size: 128
    mean_value: 104
    mean_value: 117
    mean_value: 124
    resize_param {
      prob: 1.0
      resize_mode: FIT_SMALL_SIZE
      height: 144
      width: 144
      pad_mode: MIRRORED
      pad_value: 104
      pad_value: 117
      pad_value: 124
      interp_mode: CUBIC
      center_object: false
      max_angle: 0
    }
  }
  data_param {
    source: "/home/old-ufo/datasets/imagenet/ilsvrc12_train_shuffle_lmdb"
    backend: LMDB
    batch_size: 256
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    force_color: true
    scale: 0.04
    mirror: false
    crop_size: 128
    mean_value: 104
    mean_value: 117
    mean_value: 123
    resize_param {
      prob: 1.0
      resize_mode: FIT_SMALL_SIZE
      height: 144
      width: 144
      pad_mode: MIRRORED
      pad_value: 104
      pad_value: 117
      pad_value: 124
      interp_mode: CUBIC
      center_object: false
      max_angle: 0
    }
  }
  data_param {
    source: "/home/old-ufo/datasets/imagenet/ilsvrc12_val_lmdb"    
    backend: LMDB
    batch_size: 250
  }
}
layer {
  name: "conv0"
  type: "Convolution"
  bottom: "data"
  top: "conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv0/nl"
  type: "ReLU"
  bottom: "conv0"
  top: "conv0"
}

layer {
  name: "pool0"
  type: "Pooling"
  bottom: "conv0"
  top: "pool0"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "stage0/block0/conv_reduce"
  type: "Convolution"
  bottom: "pool0"
  top: "stage0/block0/conv_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 36
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage0/block0/conv_reduce/nl"
  type: "ReLU"
  bottom: "stage0/block0/conv_reduce"
  top: "stage0/block0/conv_reduce"
}
layer {
  name: "stage0/block0/conv_reduce/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage0/block0/conv_reduce"
  top: "stage0/block0/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block0/conv_reduce/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage0/block0/conv_reduce"
  top: "stage0/block0/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block0/conv"
  type: "Convolution"
  bottom: "stage0/block0/conv_reduce/BN"
  top: "stage0/block0/conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 36
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage0/block0/conv/nl"
  type: "ReLU"
  bottom: "stage0/block0/conv"
  top: "stage0/block0/conv"
}
layer {
  name: "stage0/block0/conv/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage0/block0/conv"
  top: "stage0/block0/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block0/conv/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage0/block0/conv"
  top: "stage0/block0/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block0/conv_restore"
  type: "Convolution"
  bottom: "stage0/block0/conv/BN"
  top: "stage0/block0/conv_restore"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 120
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage0/block0/shortcut"
  type: "Convolution"
  bottom: "pool0"
  top: "stage0/block0/shortcut"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 120
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage0/block0/sum"
  type: "Eltwise"
  bottom: "stage0/block0/conv_restore"
  bottom: "stage0/block0/shortcut"
  top: "stage0/block0/sum"
  eltwise_param { operation: SUM }
}
layer {
  name: "stage0/block0/sum/nl"
  type: "ReLU"
  bottom: "stage0/block0/sum"
  top: "stage0/block0/sum"
}
layer {
  name: "stage0/block0/sum/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage0/block0/sum"
  top: "stage0/block0/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block0/sum/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage0/block0/sum"
  top: "stage0/block0/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block1/conv_reduce"
  type: "Convolution"
  bottom: "stage0/block0/sum/BN"
  top: "stage0/block1/conv_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 36
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage0/block1/conv_reduce/nl"
  type: "ReLU"
  bottom: "stage0/block1/conv_reduce"
  top: "stage0/block1/conv_reduce"
}
layer {
  name: "stage0/block1/conv_reduce/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage0/block1/conv_reduce"
  top: "stage0/block1/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block1/conv_reduce/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage0/block1/conv_reduce"
  top: "stage0/block1/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block1/conv"
  type: "Convolution"
  bottom: "stage0/block1/conv_reduce/BN"
  top: "stage0/block1/conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 36
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage0/block1/conv/nl"
  type: "ReLU"
  bottom: "stage0/block1/conv"
  top: "stage0/block1/conv"
}
layer {
  name: "stage0/block1/conv/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage0/block1/conv"
  top: "stage0/block1/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block1/conv/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage0/block1/conv"
  top: "stage0/block1/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block1/conv_restore"
  type: "Convolution"
  bottom: "stage0/block1/conv/BN"
  top: "stage0/block1/conv_restore"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 120
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage0/block1/sum"
  type: "Eltwise"
  bottom: "stage0/block1/conv_restore"
  bottom: "stage0/block0/sum/BN"
  top: "stage0/block1/sum"
  eltwise_param { operation: SUM }
}
layer {
  name: "stage0/block1/sum/nl"
  type: "ReLU"
  bottom: "stage0/block1/sum"
  top: "stage0/block1/sum"
}
layer {
  name: "stage0/block1/sum/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage0/block1/sum"
  top: "stage0/block1/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block1/sum/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage0/block1/sum"
  top: "stage0/block1/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block2/conv_reduce"
  type: "Convolution"
  bottom: "stage0/block1/sum/BN"
  top: "stage0/block2/conv_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 36
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage0/block2/conv_reduce/nl"
  type: "ReLU"
  bottom: "stage0/block2/conv_reduce"
  top: "stage0/block2/conv_reduce"
}
layer {
  name: "stage0/block2/conv_reduce/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage0/block2/conv_reduce"
  top: "stage0/block2/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block2/conv_reduce/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage0/block2/conv_reduce"
  top: "stage0/block2/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block2/conv"
  type: "Convolution"
  bottom: "stage0/block2/conv_reduce/BN"
  top: "stage0/block2/conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 36
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage0/block2/conv/nl"
  type: "ReLU"
  bottom: "stage0/block2/conv"
  top: "stage0/block2/conv"
}
layer {
  name: "stage0/block2/conv/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage0/block2/conv"
  top: "stage0/block2/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block2/conv/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage0/block2/conv"
  top: "stage0/block2/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block2/conv_restore"
  type: "Convolution"
  bottom: "stage0/block2/conv/BN"
  top: "stage0/block2/conv_restore"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 120
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage0/block2/sum"
  type: "Eltwise"
  bottom: "stage0/block2/conv_restore"
  bottom: "stage0/block1/sum/BN"
  top: "stage0/block2/sum"
  eltwise_param { operation: SUM }
}
layer {
  name: "stage0/block2/sum/nl"
  type: "ReLU"
  bottom: "stage0/block2/sum"
  top: "stage0/block2/sum"
}
layer {
  name: "stage0/block2/sum/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage0/block2/sum"
  top: "stage0/block2/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage0/block2/sum/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage0/block2/sum"
  top: "stage0/block2/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block0/conv_reduce"
  type: "Convolution"
  bottom: "stage0/block2/sum/BN"
  top: "stage1/block0/conv_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 72
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1/block0/conv_reduce/nl"
  type: "ReLU"
  bottom: "stage1/block0/conv_reduce"
  top: "stage1/block0/conv_reduce"
}
layer {
  name: "stage1/block0/conv_reduce/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage1/block0/conv_reduce"
  top: "stage1/block0/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block0/conv_reduce/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage1/block0/conv_reduce"
  top: "stage1/block0/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block0/conv"
  type: "Convolution"
  bottom: "stage1/block0/conv_reduce/BN"
  top: "stage1/block0/conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 72
    kernel_size: 3
    stride: 2
    pad: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1/block0/conv/nl"
  type: "ReLU"
  bottom: "stage1/block0/conv"
  top: "stage1/block0/conv"
}
layer {
  name: "stage1/block0/conv/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage1/block0/conv"
  top: "stage1/block0/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block0/conv/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage1/block0/conv"
  top: "stage1/block0/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block0/conv_restore"
  type: "Convolution"
  bottom: "stage1/block0/conv/BN"
  top: "stage1/block0/conv_restore"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 240
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1/block0/shortcut"
  type: "Convolution"
  bottom: "stage0/block2/sum/BN"
  top: "stage1/block0/shortcut"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 240
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1/block0/sum"
  type: "Eltwise"
  bottom: "stage1/block0/conv_restore"
  bottom: "stage1/block0/shortcut"
  top: "stage1/block0/sum"
  eltwise_param { operation: SUM }
}
layer {
  name: "stage1/block0/sum/nl"
  type: "ReLU"
  bottom: "stage1/block0/sum"
  top: "stage1/block0/sum"
}
layer {
  name: "stage1/block0/sum/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage1/block0/sum"
  top: "stage1/block0/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block0/sum/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage1/block0/sum"
  top: "stage1/block0/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block1/conv_reduce"
  type: "Convolution"
  bottom: "stage1/block0/sum/BN"
  top: "stage1/block1/conv_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 72
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1/block1/conv_reduce/nl"
  type: "ReLU"
  bottom: "stage1/block1/conv_reduce"
  top: "stage1/block1/conv_reduce"
}
layer {
  name: "stage1/block1/conv_reduce/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage1/block1/conv_reduce"
  top: "stage1/block1/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block1/conv_reduce/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage1/block1/conv_reduce"
  top: "stage1/block1/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block1/conv"
  type: "Convolution"
  bottom: "stage1/block1/conv_reduce/BN"
  top: "stage1/block1/conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 72
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1/block1/conv/nl"
  type: "ReLU"
  bottom: "stage1/block1/conv"
  top: "stage1/block1/conv"
}
layer {
  name: "stage1/block1/conv/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage1/block1/conv"
  top: "stage1/block1/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block1/conv/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage1/block1/conv"
  top: "stage1/block1/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block1/conv_restore"
  type: "Convolution"
  bottom: "stage1/block1/conv/BN"
  top: "stage1/block1/conv_restore"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 240
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1/block1/sum"
  type: "Eltwise"
  bottom: "stage1/block1/conv_restore"
  bottom: "stage1/block0/sum/BN"
  top: "stage1/block1/sum"
  eltwise_param { operation: SUM }
}
layer {
  name: "stage1/block1/sum/nl"
  type: "ReLU"
  bottom: "stage1/block1/sum"
  top: "stage1/block1/sum"
}
layer {
  name: "stage1/block1/sum/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage1/block1/sum"
  top: "stage1/block1/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block1/sum/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage1/block1/sum"
  top: "stage1/block1/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block2/conv_reduce"
  type: "Convolution"
  bottom: "stage1/block1/sum/BN"
  top: "stage1/block2/conv_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 72
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1/block2/conv_reduce/nl"
  type: "ReLU"
  bottom: "stage1/block2/conv_reduce"
  top: "stage1/block2/conv_reduce"
}
layer {
  name: "stage1/block2/conv_reduce/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage1/block2/conv_reduce"
  top: "stage1/block2/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block2/conv_reduce/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage1/block2/conv_reduce"
  top: "stage1/block2/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block2/conv"
  type: "Convolution"
  bottom: "stage1/block2/conv_reduce/BN"
  top: "stage1/block2/conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 72
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1/block2/conv/nl"
  type: "ReLU"
  bottom: "stage1/block2/conv"
  top: "stage1/block2/conv"
}
layer {
  name: "stage1/block2/conv/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage1/block2/conv"
  top: "stage1/block2/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block2/conv/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage1/block2/conv"
  top: "stage1/block2/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block2/conv_restore"
  type: "Convolution"
  bottom: "stage1/block2/conv/BN"
  top: "stage1/block2/conv_restore"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 240
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1/block2/sum"
  type: "Eltwise"
  bottom: "stage1/block2/conv_restore"
  bottom: "stage1/block1/sum/BN"
  top: "stage1/block2/sum"
  eltwise_param { operation: SUM }
}
layer {
  name: "stage1/block2/sum/nl"
  type: "ReLU"
  bottom: "stage1/block2/sum"
  top: "stage1/block2/sum"
}
layer {
  name: "stage1/block2/sum/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage1/block2/sum"
  top: "stage1/block2/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block2/sum/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage1/block2/sum"
  top: "stage1/block2/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block3/conv_reduce"
  type: "Convolution"
  bottom: "stage1/block2/sum/BN"
  top: "stage1/block3/conv_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 72
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1/block3/conv_reduce/nl"
  type: "ReLU"
  bottom: "stage1/block3/conv_reduce"
  top: "stage1/block3/conv_reduce"
}
layer {
  name: "stage1/block3/conv_reduce/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage1/block3/conv_reduce"
  top: "stage1/block3/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block3/conv_reduce/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage1/block3/conv_reduce"
  top: "stage1/block3/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block3/conv"
  type: "Convolution"
  bottom: "stage1/block3/conv_reduce/BN"
  top: "stage1/block3/conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 72
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1/block3/conv/nl"
  type: "ReLU"
  bottom: "stage1/block3/conv"
  top: "stage1/block3/conv"
}
layer {
  name: "stage1/block3/conv/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage1/block3/conv"
  top: "stage1/block3/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block3/conv/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage1/block3/conv"
  top: "stage1/block3/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block3/conv_restore"
  type: "Convolution"
  bottom: "stage1/block3/conv/BN"
  top: "stage1/block3/conv_restore"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 240
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1/block3/sum"
  type: "Eltwise"
  bottom: "stage1/block3/conv_restore"
  bottom: "stage1/block2/sum/BN"
  top: "stage1/block3/sum"
  eltwise_param { operation: SUM }
}
layer {
  name: "stage1/block3/sum/nl"
  type: "ReLU"
  bottom: "stage1/block3/sum"
  top: "stage1/block3/sum"
}
layer {
  name: "stage1/block3/sum/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage1/block3/sum"
  top: "stage1/block3/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage1/block3/sum/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage1/block3/sum"
  top: "stage1/block3/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block0/conv_reduce"
  type: "Convolution"
  bottom: "stage1/block3/sum/BN"
  top: "stage2/block0/conv_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2/block0/conv_reduce/nl"
  type: "ReLU"
  bottom: "stage2/block0/conv_reduce"
  top: "stage2/block0/conv_reduce"
}
layer {
  name: "stage2/block0/conv_reduce/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage2/block0/conv_reduce"
  top: "stage2/block0/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block0/conv_reduce/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage2/block0/conv_reduce"
  top: "stage2/block0/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block0/conv"
  type: "Convolution"
  bottom: "stage2/block0/conv_reduce/BN"
  top: "stage2/block0/conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 2
    pad: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2/block0/conv/nl"
  type: "ReLU"
  bottom: "stage2/block0/conv"
  top: "stage2/block0/conv"
}
layer {
  name: "stage2/block0/conv/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage2/block0/conv"
  top: "stage2/block0/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block0/conv/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage2/block0/conv"
  top: "stage2/block0/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block0/conv_restore"
  type: "Convolution"
  bottom: "stage2/block0/conv/BN"
  top: "stage2/block0/conv_restore"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2/block0/shortcut"
  type: "Convolution"
  bottom: "stage1/block3/sum/BN"
  top: "stage2/block0/shortcut"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2/block0/sum"
  type: "Eltwise"
  bottom: "stage2/block0/conv_restore"
  bottom: "stage2/block0/shortcut"
  top: "stage2/block0/sum"
  eltwise_param { operation: SUM }
}
layer {
  name: "stage2/block0/sum/nl"
  type: "ReLU"
  bottom: "stage2/block0/sum"
  top: "stage2/block0/sum"
}
layer {
  name: "stage2/block0/sum/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage2/block0/sum"
  top: "stage2/block0/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block0/sum/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage2/block0/sum"
  top: "stage2/block0/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block1/conv_reduce"
  type: "Convolution"
  bottom: "stage2/block0/sum/BN"
  top: "stage2/block1/conv_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2/block1/conv_reduce/nl"
  type: "ReLU"
  bottom: "stage2/block1/conv_reduce"
  top: "stage2/block1/conv_reduce"
}
layer {
  name: "stage2/block1/conv_reduce/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage2/block1/conv_reduce"
  top: "stage2/block1/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block1/conv_reduce/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage2/block1/conv_reduce"
  top: "stage2/block1/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block1/conv"
  type: "Convolution"
  bottom: "stage2/block1/conv_reduce/BN"
  top: "stage2/block1/conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2/block1/conv/nl"
  type: "ReLU"
  bottom: "stage2/block1/conv"
  top: "stage2/block1/conv"
}
layer {
  name: "stage2/block1/conv/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage2/block1/conv"
  top: "stage2/block1/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block1/conv/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage2/block1/conv"
  top: "stage2/block1/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block1/conv_restore"
  type: "Convolution"
  bottom: "stage2/block1/conv/BN"
  top: "stage2/block1/conv_restore"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2/block1/sum"
  type: "Eltwise"
  bottom: "stage2/block1/conv_restore"
  bottom: "stage2/block0/sum/BN"
  top: "stage2/block1/sum"
  eltwise_param { operation: SUM }
}
layer {
  name: "stage2/block1/sum/nl"
  type: "ReLU"
  bottom: "stage2/block1/sum"
  top: "stage2/block1/sum"
}
layer {
  name: "stage2/block1/sum/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage2/block1/sum"
  top: "stage2/block1/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block1/sum/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage2/block1/sum"
  top: "stage2/block1/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block2/conv_reduce"
  type: "Convolution"
  bottom: "stage2/block1/sum/BN"
  top: "stage2/block2/conv_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2/block2/conv_reduce/nl"
  type: "ReLU"
  bottom: "stage2/block2/conv_reduce"
  top: "stage2/block2/conv_reduce"
}
layer {
  name: "stage2/block2/conv_reduce/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage2/block2/conv_reduce"
  top: "stage2/block2/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block2/conv_reduce/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage2/block2/conv_reduce"
  top: "stage2/block2/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block2/conv"
  type: "Convolution"
  bottom: "stage2/block2/conv_reduce/BN"
  top: "stage2/block2/conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2/block2/conv/nl"
  type: "ReLU"
  bottom: "stage2/block2/conv"
  top: "stage2/block2/conv"
}
layer {
  name: "stage2/block2/conv/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage2/block2/conv"
  top: "stage2/block2/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block2/conv/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage2/block2/conv"
  top: "stage2/block2/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block2/conv_restore"
  type: "Convolution"
  bottom: "stage2/block2/conv/BN"
  top: "stage2/block2/conv_restore"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2/block2/sum"
  type: "Eltwise"
  bottom: "stage2/block2/conv_restore"
  bottom: "stage2/block1/sum/BN"
  top: "stage2/block2/sum"
  eltwise_param { operation: SUM }
}
layer {
  name: "stage2/block2/sum/nl"
  type: "ReLU"
  bottom: "stage2/block2/sum"
  top: "stage2/block2/sum"
}
layer {
  name: "stage2/block2/sum/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage2/block2/sum"
  top: "stage2/block2/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block2/sum/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage2/block2/sum"
  top: "stage2/block2/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block3/conv_reduce"
  type: "Convolution"
  bottom: "stage2/block2/sum/BN"
  top: "stage2/block3/conv_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2/block3/conv_reduce/nl"
  type: "ReLU"
  bottom: "stage2/block3/conv_reduce"
  top: "stage2/block3/conv_reduce"
}
layer {
  name: "stage2/block3/conv_reduce/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage2/block3/conv_reduce"
  top: "stage2/block3/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block3/conv_reduce/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage2/block3/conv_reduce"
  top: "stage2/block3/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block3/conv"
  type: "Convolution"
  bottom: "stage2/block3/conv_reduce/BN"
  top: "stage2/block3/conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2/block3/conv/nl"
  type: "ReLU"
  bottom: "stage2/block3/conv"
  top: "stage2/block3/conv"
}
layer {
  name: "stage2/block3/conv/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage2/block3/conv"
  top: "stage2/block3/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block3/conv/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage2/block3/conv"
  top: "stage2/block3/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block3/conv_restore"
  type: "Convolution"
  bottom: "stage2/block3/conv/BN"
  top: "stage2/block3/conv_restore"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2/block3/sum"
  type: "Eltwise"
  bottom: "stage2/block3/conv_restore"
  bottom: "stage2/block2/sum/BN"
  top: "stage2/block3/sum"
  eltwise_param { operation: SUM }
}
layer {
  name: "stage2/block3/sum/nl"
  type: "ReLU"
  bottom: "stage2/block3/sum"
  top: "stage2/block3/sum"
}
layer {
  name: "stage2/block3/sum/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage2/block3/sum"
  top: "stage2/block3/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block3/sum/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage2/block3/sum"
  top: "stage2/block3/sum/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block4/conv_reduce"
  type: "Convolution"
  bottom: "stage2/block3/sum/BN"
  top: "stage2/block4/conv_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2/block4/conv_reduce/nl"
  type: "ReLU"
  bottom: "stage2/block4/conv_reduce"
  top: "stage2/block4/conv_reduce"
}
layer {
  name: "stage2/block4/conv_reduce/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage2/block4/conv_reduce"
  top: "stage2/block4/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block4/conv_reduce/BN"
  type: "BatchNorm" include {phase: TEST}
  bottom: "stage2/block4/conv_reduce"
  top: "stage2/block4/conv_reduce/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "stage2/block4/conv"
  type: "Convolution"
  bottom: "stage2/block4/conv_reduce/BN"
  top: "stage2/block4/conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2/block4/conv/nl"
  type: "ReLU"
  bottom: "stage2/block4/conv"
  top: "stage2/block4/conv"
}
layer {
  name: "stage2/block4/conv/BN"
  type: "BatchNorm" include {phase: TRAIN}
  bottom: "stage2/block4/conv"
  top: "stage2/block4/conv/BN"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
